ilg-archived/qemu/hw/arm/kinetis_mcus.c
/*
 * Freescale Kinetis Cortex-M devices emulation
 *
 * Copyright (c) 2014 Liviu Ionescu
 *
 * This code is licensed under the GPL.
 */

#include "hw/arm/kinetis.h"
#include "hw/arm/cortexm.h"

/*
 Package identifier:
 FM = 32 QFN (5 mm x 5 mm)
 FT = 48 QFN (7 mm x 7 mm)
 LF = 48 LQFP (7 mm x 7 mm)
 LH = 64 LQFP (10 mm x 10 mm)
 MP = 64 MAPBGA (5 mm x 5 mm)
 LK = 80 LQFP (12 mm x 12 mm)
 MB = 81 MAPBGA (8 mm x 8 mm)
 LL = 100 LQFP (14 mm x 14 mm)
 ML = 104 MAPBGA (8 mm x 8 mm)
 MC = 121 MAPBGA (8 mm x 8 mm)
 LQ = 144 LQFP (20 mm x 20 mm)
 MD = 144 MAPBGA (13 mm x 13 mm)
 MJ = 256 MAPBGA (17 mm x 17 mm)
 */

/* ----- MK20DX128VLH5 ----- */
static cortex_m_core_info mk20dx128vlh5_core_info = {
    .device_name = "MK20DX128VLH5",
    .flash_size_kb = 128, /* +32K FlexNVM at 0x10000000 */
    .sram_size_kb = 8, /* +8K SRAM_L */
    .has_mpu = false,
    .has_fpu = false,
};

qemu_irq *mk20dx128vlh5_mcu_init(MachineState *machine)
{
    return cortex_m4_core_init(&mk20dx128vlh5_core_info, machine);
}

/* ----- MK22FN512VLH12 ----- */
static cortex_m_core_info mk22fn512vlh12_core_info = {
    .device_name = "MK22FN512VLH12",
    .flash_size_kb = 512,
    .sram_size_kb = 64, /* +64K SRAM_L */
    .has_mpu = false,
    .has_fpu = false,
};

qemu_irq *mk22fn512vlh12_mcu_init(MachineState *machine)
{
    return cortex_m4_core_init(&mk22fn512vlh12_core_info, machine);
}

/* ----- MK64FN1M0VLL12 ----- */
static cortex_m_core_info mk64fn1m0vll12_core_info = {
    .device_name = "MK64FN1M0VLL12",
    .flash_size_kb = 1024,
    .sram_size_kb = 192, /* +64K SRAM_L */
    .has_mpu = true,
    .has_fpu = true,
};

qemu_irq *mk64fn1m0vll12_mcu_init(MachineState *machine)
{
    return cortex_m4_core_init(&mk64fn1m0vll12_core_info, machine);
}

/* ----- MK60FN1M0VLQ12 ----- */
static cortex_m_core_info mk60fn1m0vlq12_core_info = {
    .device_name = "MK60FN1M0VLQ12",
    .flash_size_kb = 1024,
    .sram_size_kb = 192, /* +64K SRAM_L */
    .has_mpu = true,
    .has_fpu = true,
};

qemu_irq *mk60fn1m0vlq12_mcu_init(MachineState *machine)
{
    return cortex_m4_core_init(&mk60fn1m0vlq12_core_info, machine);
}

/* ----- MKL25Z128VLK4 ----- */
static cortex_m_core_info mkl25z128vlk4_core_info = {
    .device_name = "MKL25Z128VLK4",
    .flash_size_kb = 128,
    .sram_size_kb = 12, /* +4K SRAM_L */
    .has_mpu = false,
};

qemu_irq *mkl25z128vlk4_mcu_init(MachineState *machine)
{
    return cortex_m0p_core_init(&mkl25z128vlk4_core_info, machine);
}

/* ----- MKL26Z128VLH4 ----- */
static cortex_m_core_info mkl26z128vlh4_core_info = {
    .device_name = "MKL26Z128VLH4",
    .flash_size_kb = 128,
    .sram_size_kb = 12, /* +4K SRAM_L */
    .has_mpu = false,
};

qemu_irq *mkl26z128vlh4_mcu_init(MachineState *machine)
{
    return cortex_m0p_core_init(&mkl26z128vlh4_core_info, machine);
}

/* ----- MKL43Z256VLH4 ----- */
static cortex_m_core_info mkl43z256vlh4_core_info = {
    .device_name = "MKL43Z256VLH4",
    .flash_size_kb = 256,
    .sram_size_kb = 24, /* +8K SRAM_L */
    .has_mpu = false,
};

qemu_irq *mkl43z256vlh4_mcu_init(MachineState *machine)
{
    return cortex_m0p_core_init(&mkl43z256vlh4_core_info, machine);
}

/* ----- MKL46Z256VLL4 ----- */
static cortex_m_core_info mkl46z256vll4_core_info = {
    .device_name = "MKL46Z256VLL4",
    .flash_size_kb = 256,
    .sram_size_kb = 24, /* +8K SRAM_L */
    .has_mpu = false,
};

qemu_irq *mkl46z256vll4_mcu_init(MachineState *machine)
{
    return cortex_m0p_core_init(&mkl46z256vll4_core_info, machine);
}

